In [21]:
import pandas as pd

In [22]:
import numpy as np

In [23]:
obj = pd.Series(np.arange(5), index = ['a','b','c','d','e'])

In [24]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [25]:
obj["c"]

2

In [26]:
obj[0:3]

a    0
b    1
c    2
dtype: int32

In [27]:
obj.loc['a':'c']    # obj[['a', 'c']]

a    0
b    1
c    2
dtype: int32

In [28]:
obj[[0, 2]]

a    0
c    2
dtype: int32

In [29]:
obj[obj<2]

a    0
b    1
dtype: int32

In [30]:
obj.loc['a':'c']

a    0
b    1
c    2
dtype: int32

In [31]:
obj['b':'c'] = 5

In [32]:
obj

a    0
b    5
c    5
d    3
e    4
dtype: int32

In [33]:
# Data frame indexing

In [43]:
data = pd.DataFrame(
    np.arange(16).reshape(4,4), index = ["London", "Paris", "Berlin", "Istanbul"],
    
    columns = ["one", "two", "three", "four"]
)

In [44]:
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [45]:
data["two"]

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int32

In [47]:
data.two

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int32

In [48]:
data[0:3]

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [49]:
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [56]:
data[data["four"]>5]

          one  two  three  four
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [58]:
data[data<5] = 0

In [59]:
data

          one  two  three  four
London      0    0      0     0
Paris       0    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [70]:
data.iloc[1] # data.loc["Paris"]

one      0
two      5
three    6
four     7
Name: Paris, dtype: int32

In [73]:
data.iloc[1, [1,2,3]]

two      5
three    6
four     7
Name: Paris, dtype: int32

In [87]:
data.loc[:"Paris", "four"]

London    0
Paris     7
Name: four, dtype: int32

In [88]:
toy_data = pd.Series(np.arange(5), index = ["a","b","c","d","e"])

In [89]:
toy_data

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [90]:
toy_data[-1]

4

In [91]:
toy_data.iloc[-1]

4